Hi @Theoooooo,

Thank you for raising this issue. It seems like there are some issue of loading .csv file. Since your terraform plan output do not have info of `services`. I would appreciate it if you could let me know your testing environment, like Terraform version, FortiOS version, FortiOS Terraform provider version. So that I could reproduce in my end and debug it. And also, could you output the local.csv_content_p to check whether parse .csv file correctly? You could add an `output` block in your .tf file, for example:
```
output "csv_content" {
  value = local.csv_content_p
}  
```

Here is the output of `terraform plan` in my end using your configuration:
```
  # fortios_firewall_policy.firewall[1] will be created
  + resource "fortios_firewall_policy" "firewall" {
      + action                      = "accept"
      + anti_replay                 = (known after apply)
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = (known after apply)
      + auth_redirect_addr          = (known after apply)
      + auto_asic_offload           = (known after apply)
      + av_profile                  = (known after apply)
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + cifs_profile                = (known after apply)
      + decrypted_traffic_mirror    = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + dynamic_sort_subtable       = "false"
      + email_collect               = (known after apply)
      + emailfilter_profile         = (known after apply)
      + file_filter_profile         = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + geoip_anycast               = (known after apply)
      + geoip_match                 = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = (known after apply)
      + internet_service            = (known after apply)
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = (known after apply)
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = (known after apply)
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + match_vip_only              = (known after apply)
      + name                        = "LAN to DMZ tre"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = (known after apply)
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = "always"
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = (known after apply)
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = (known after apply)
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstaddr {
          + name = "TRE-HOST-DMZ-01"
        }

      + dstintf {
          + name = "dmz"
        }

      + service {
          + name = "SSH"
        }
      + service {
          + name = "TCP_1000"
        }
      + service {
          + name = "TCP_2000"
        }
      + service {
          + name = "TCP_3000"
        }
      + service {
          + name = "UDP_5601"
        }
      + service {
          + name = "UDP_9000"
        }

      + srcaddr {
          + name = "TRE-HOST-01"
        }
      + srcaddr {
          + name = "TRE-HOST-02"
        }

      + srcintf {
          + name = "port1"
        }
    }
```

Please let me know if you have any questions.

Thanks,
Xing